In [4]:
import pandas as pd

In [6]:
s = pd.Series([1,2,3,4,5])

In [8]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
s.values

array([1, 2, 3, 4, 5], dtype=int64)

In [12]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
s[2]

3

In [19]:
s = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [21]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [23]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [25]:
s.dtype

dtype('int64')

In [26]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [27]:
ser = pd.Series(sdata)

In [28]:
ser

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [34]:
ser['Ohio']

35000

In [36]:
ser1 = pd.Series(sdata,index=['Ohio', 'Texas', 'Oregon', 'Utah','Eloor'])

In [37]:
ser1

Ohio      35000.0
Texas     71000.0
Oregon    16000.0
Utah       5000.0
Eloor         NaN
dtype: float64

In [40]:
pd.isnull(ser1)

Ohio      False
Texas     False
Oregon    False
Utah      False
Eloor      True
dtype: bool

In [41]:
data = {'state': ['Jay', 'RAvi', 'Mehul', 'Safwan', 'Raj'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [4, 4, 3.6, 2.4, 2.9]}

In [43]:
type(data)

dict

In [45]:
print(data)

{'state': ['Jay', 'RAvi', 'Mehul', 'Safwan', 'Raj'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [4, 4, 3.6, 2.4, 2.9]}

In [46]:
data.keys()

dict_keys(['state', 'year', 'pop'])

In [47]:
data.values()

dict_values([['Jay', 'RAvi', 'Mehul', 'Safwan', 'Raj'], [2000, 2001, 2002, 2001, 2002], [4, 4, 3.6, 2.4, 2.9]])

In [49]:
data.items()

dict_items([('state', ['Jay', 'RAvi', 'Mehul', 'Safwan', 'Raj']), ('year', [2000, 2001, 2002, 2001, 2002]), ('pop', [4, 4, 3.6, 2.4, 2.9])])

In [51]:
d=pd.DataFrame(data)

In [53]:
d

    state  year  pop
0     Jay  2000  4.0
1    RAvi  2001  4.0
2   Mehul  2002  3.6
3  Safwan  2001  2.4
4     Raj  2002  2.9

In [55]:
d.index

RangeIndex(start=0, stop=5, step=1)

In [56]:
d.values

array([['Jay', 2000, 4.0],
       ['RAvi', 2001, 4.0],
       ['Mehul', 2002, 3.6],
       ['Safwan', 2001, 2.4],
       ['Raj', 2002, 2.9]], dtype=object)

In [62]:
d1 = pd.DataFrame(data,columns=['year','state','pop','dept'])

In [65]:
s = pd.Series([1,2,3],index=[0,3,4])

In [67]:
d1['dept']=s

In [68]:
d1

   year   state  pop  dept
0  2000     Jay  4.0   1.0
1  2001    RAvi  4.0   NaN
2  2002   Mehul  3.6   NaN
3  2001  Safwan  2.4   2.0
4  2002     Raj  2.9   3.0

In [69]:
d1.state

0       Jay
1      RAvi
2     Mehul
3    Safwan
4       Raj
Name: state, dtype: object

In [71]:
d1['state']

0       Jay
1      RAvi
2     Mehul
3    Safwan
4       Raj
Name: state, dtype: object

In [79]:
d1['Easter'] = d1['state'] == 'Mehul'

In [81]:
d1

   year   state  pop  dept  Easter
0  2000     Jay  4.0   1.0   False
1  2001    RAvi  4.0   NaN   False
2  2002   Mehul  3.6   NaN    True
3  2001  Safwan  2.4   2.0   False
4  2002     Raj  2.9   3.0   False

In [83]:
d1.T

            0      1      2       3      4
year     2000   2001   2002    2001   2002
state     Jay   RAvi  Mehul  Safwan    Raj
pop         4      4    3.6     2.4    2.9
dept        1    NaN    NaN       2      3
Easter  False  False   True   False  False

In [85]:
dic = {'key1':{'key11':1},'key2':{'key22':2}}

In [87]:
pd.DataFrame(dic)

       key1  key2
key11   1.0   NaN
key22   NaN   2.0

In [88]:
import numpy as np
df = pd.DataFrame(np.arange(16).reshape(4,4),index=['IND','US','UAE','UK'],columns=['d','c','a','b'])

In [89]:
df

      d   c   a   b
IND   0   1   2   3
US    4   5   6   7
UAE   8   9  10  11
UK   12  13  14  15

In [98]:
df[['c','a','b']]

      c   a   b
IND   1   2   3
US    5   6   7
UAE   9  10  11
UK   13  14  15

In [100]:
df.ix[['IND','US']]

C:\Users\Ameen\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

     d  c  a  b
IND  0  1  2  3
US   4  5  6  7

In [103]:
list('abcd')

['a', 'b', 'c', 'd']

In [107]:
np.max(df,axis=1)

IND     3
US      7
UAE    11
UK     15
dtype: int32

In [109]:
clear

In [110]:
import numpy as np
import pandas as pd

In [112]:
arr1=np.array([1,2,3],[4,5,6])
arr2=np.array([3,4,5],[8,0,3])

In [117]:
arr_concat=np.concatenate([arr1,arr2],axis=0)

In [119]:
arr_concat

array([1, 2, 3, 4, 5, 3, 4, 5])